base/InformationRegisters/бит_ШаблоныПроводокБюджетированияСтатейОборотов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ШаблоныПроводокБюджетированияСтатейОборотов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Назначено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектСШаблонами</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШаблонПроводки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ШаблоныПроводокБюджетирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/Catalogs/бит_ШаблоныПроводокБюджетирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ШаблоныПроводокБюджетирования</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СчетДТ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Бюджетирование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКТ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.бит_Бюджетирование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/CommonModules/бит_БюджетированиеБалансовыйУчет/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс
	
// Процедура формирует проводки по регистру бухгалтерии бюджетирование.
// 
// Параметры:
//  ТаблицаДанные              - ТаблицаЗначений - Таблица по которой формируются движения 
// 								 				   по регистру бит_ОборотыПоБюджетам
//  НаборЗаписейБюджетирование - РегистрБухгалтерииНаборЗаписей.бит_Бюджетирование
//  ОчищатьНаборЗаписей		   - Булево (По умолчанию = Истина)
//  ДатаСторно                 - Дата (По умолчанию = Неопределено).
// 
Процедура СформироватьПроводкиБюджетирования(ТаблицаДанные, НаборЗаписейБюджетирование, 
			ОчищатьНаборЗаписей = Истина, ДатаСторно = Неопределено) Экспорт

	// Балансовый учет ведется только в опции "Проф".
	Если НЕ ПолучитьФункциональнуюОпцию("бит_ПРОФ") Тогда
		Возврат;	
	КонецЕсли;
	
	Если ОчищатьНаборЗаписей Тогда
		НаборЗаписейБюджетирование.Очистить();
		НаборЗаписейБюджетирование.Записывать = Истина;	
	КонецЕсли;	
	
	Статьи = ТаблицаДанные.ВыгрузитьКолонку("СтатьяОборотов");	
	ОбщегоНазначенияКлиентСервер.СвернутьМассив(Статьи);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Статьи",Статьи);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатьиОборотов.Ссылка КАК СтатьяОборотов,
	|	ШаблоныПроводок.СчетДТ КАК СчетДТ,
	|	ШаблоныПроводок.СчетКТ КАК СчетКТ,
	|	ШаблоныПроводок.КоэффициентСумма КАК КоэффициентСумма,
	|	ШаблоныПроводок.КоэффициентКоличество КАК КоэффициентКоличество,
	|	ШаблоныПроводок.Содержание КАК Содержание
	|ИЗ
	|	Справочник.бит_СтатьиОборотов КАК СтатьиОборотов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_ШаблоныПроводокБюджетированияСтатейОборотов КАК НазначенныеШаблоны
	|		ПО СтатьиОборотов.Ссылка = НазначенныеШаблоны.ОбъектСШаблонами
	|			И (СтатьиОборотов.Ссылка В (&Статьи))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бит_ШаблоныПроводокБюджетирования КАК ШаблоныПроводок
	|		ПО (НазначенныеШаблоны.ШаблонПроводки = ШаблоныПроводок.Ссылка)
	|ГДЕ
	|	СтатьиОборотов.Ссылка В(&Статьи)
	|	И НЕ СтатьиОборотов.НеФормироватьПроводкиБюджетирования
	|ИТОГИ ПО
	|	СтатьяОборотов";

	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда	
		Возврат; 	
	КонецЕсли; 
	
	ОписаниеСчет    = Новый ОписаниеТипов("ПланСчетовСсылка.бит_Бюджетирование");
	ОписаниеЧисло   = Новый ОписаниеТипов("Число"); 
	ОписаниеСтрока  = Новый ОписаниеТипов("Строка");
	ОписаниеСпособ  = Новый ОписаниеТипов("ПеречислениеСсылка.бит_СпособыЗаполненияСуммПроводокБюджетирования");
	
	// Заполним соответствие статья - таблица шаблонов проводок.
	ШаблоныПроводок = Новый Соответствие;
	
	ВыборкаСтатьи = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСтатьи.Следующий() Цикл
		
		Шаблон 	= НовыйШаблонПроводки();
		Выборка = ВыборкаСтатьи.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = Шаблон.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
		КонецЦикла;
		
		ШаблоныПроводок.Вставить(ВыборкаСтатьи.СтатьяОборотов, Шаблон);
	КонецЦикла;
	
	// Подготовим данные, необходимые для формирования проводок.
	Измерения	   = бит_Бюджетирование.ПолучитьИзмеренияБюджетирования("все","имя");
	ИмяОрганизация = бит_МеханизмДопИзмерений.ИмяДопИзмененияОрганизация();
	
	Постфиксы = Новый Массив;
	Постфиксы.Добавить("Регл");
	Постфиксы.Добавить("Упр");
	Постфиксы.Добавить("Сценарий");
	
	КоличествоСубконто = Метаданные.ПланыСчетов.бит_Бюджетирование.МаксКоличествоСубконто;
	
	// Формируем проводки
	Для каждого СтрокаДанные Из ТаблицаДанные Цикл
		
		Шаблон = ШаблоныПроводок[СтрокаДанные.СтатьяОборотов];
		Если НЕ ЗначениеЗаполнено(Шаблон) Тогда
			Продолжить;	
		КонецЕсли;
		
		// Заполним соответствие аналитик для установки субконто.
		АналитикиУчета = Новый Соответствие;
		
		Для каждого КлючИЗначение Из Измерения Цикл
			ЗначениеИзмерения = СтрокаДанные[КлючИЗначение.Ключ];
			Если ЗначениеЗаполнено(ЗначениеИзмерения) Тогда
				АналитикиУчета.Вставить(ТипЗнч(ЗначениеИзмерения),ЗначениеИзмерения);
			КонецЕсли; 
		КонецЦикла; // По аналитикам учета
		
		Для каждого СтрокаШаблон Из Шаблон Цикл
			
			Проводка = НаборЗаписейБюджетирование.Добавить();
			Проводка.Активность = Истина;				
			Проводка.Период     = СтрокаДанные.Период;
			
			// Измерения
			Проводка.Сценарий = СтрокаДанные.Сценарий;
			Если ЗначениеЗаполнено(ИмяОрганизация) Тогда					
				Проводка.Организация = СтрокаДанные[ИмяОрганизация];					
			КонецЕсли;	
			Проводка.ЦФО = СтрокаДанные.ЦФО;
			
			// Счета, субконто, небалансовые ресурсы
			ЗаполнитьНебалансовыеСвойства(СтрокаДанные,СтрокаШаблон,АналитикиУчета,Проводка,КоличествоСубконто,"Дт");
			ЗаполнитьНебалансовыеСвойства(СтрокаДанные,СтрокаШаблон,АналитикиУчета,Проводка,КоличествоСубконто,"Кт");
			
			// Балансовые ресурсы				
			Для каждого Постфикс Из Постфиксы Цикл
				СуммаКУстановке = СтрокаДанные["Сумма"+Постфикс];
				Проводка["Сумма"+Постфикс] = СуммаКУстановке*СтрокаШаблон.КоэффициентСумма;
			КонецЦикла; 
			
			// Реквизиты
			Проводка.СтатьяОборотов = СтрокаДанные.СтатьяОборотов;
			Проводка.Содержание     = СтрокаШаблон.Содержание;
			
			// Т.к. свойство строки "КлючСценарийЦФО" не гарантируется, используем универсвальный подход.
			Буфер = Новый Структура("КлючСценарийЦФО", Неопределено); 
			ЗаполнитьЗначенияСвойств(Буфер, СтрокаДанные); 
			Проводка.КлючСценарийЦФО = Буфер.КлючСценарийЦФО;
			
			// Движения сторно, если необходимо
			Если ЗначениеЗаполнено(ДатаСторно) Тогда
				ПроводкаСторно = НаборЗаписейБюджетирование.Добавить();
				ЗаполнитьЗначенияСвойств(ПроводкаСторно, Проводка);
				ПроводкаСторно.Период = ДатаСторно;
				// Ресурсы с минусом
				Для каждого Постфикс Из Постфиксы Цикл
					ПроводкаСторно["Сумма" + Постфикс] = - Проводка["Сумма" + Постфикс];
				КонецЦикла;
			КонецЕсли;               
		КонецЦикла;
	КонецЦикла;

	// Наследование свойства набора "Активность".
	Если ЗначениеЗаполнено(ТаблицаДанные) Тогда		
		ЕстьКолонкаАктивность = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(
									ТаблицаДанные[0], "Активность");
		Если ЕстьКолонкаАктивность Тогда
			НаборЗаписейБюджетирование.УстановитьАктивность(ТаблицаДанные[0].Активность);
		КонецЕсли;							
	КонецЕсли;
	
КонецПроцедуры // СформироватьПроводкиБюджетирования()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура заполняет небалансовый свойства (счета,субконто,валюту,небалансовые ресурсы) 
// проводки бюджетирования.
// 
// Параметры:
//  СтрокаДанные  - СтрокаТаблицыЗначений
//  СтрокаШаблон  - СтрокаТаблицыЗначений
//  АналитикиУчета- Соответствие
//  Проводка      - РегистрБухгалтериибит_Бюджетирование.Запись
//  КоличествоСубконтоБюджетирование - Число
//  ДтКт                             - Строка - "Дт";"Кт".
// 
Процедура ЗаполнитьНебалансовыеСвойства(СтрокаДанные,СтрокаШаблон,АналитикиУчета,Проводка,КоличествоСубконтоБюдж,ДтКт)

	ИмяСчета         = "Счет"+ДтКт;
	ИмяКоличество    = "Количество"+ДтКт;
	ИмяСубконто      = "Субконто"+ДтКт;
	ИмяВалюты        = "Валюта"+ДтКт;
	ИмяВалютнойСуммы = "ВалютнаяСумма"+ДтКт;
	
	// Счета
	Проводка[ИмяСчета] = СтрокаШаблон[ИмяСчета];
	СвСч = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Проводка[ИмяСчета]);
    
	// Субконто
	Для Ном = 1 По КоличествоСубконтоБюдж Цикл
        
        Если Ном <= СвСч.КоличествоСубконто Тогда
            
            ВидСубконто = СвСч["ВидСубконто" + Ном];
            ТипЗнчСуб   = СвСч["ВидСубконто" + Ном + "ТипЗначения"];
            
            Если ТипЗнчСуб.Типы().Количество() > 1  Тогда
				// Установка значения для составных типов
				Для каждого КиЗ Из АналитикиУчета Цикл
					Если ТипЗнчСуб.СодержитТип(КиЗ.Ключ) Тогда
						 Проводка[ИмяСубконто][ВидСубконто] = ТипЗнчСуб.ПривестиЗначение(КиЗ.Значение);
						 Прервать;
					КонецЕсли;	
				КонецЦикла; 
			Иначе	
				ТипЗнчСубконто   = ТипЗнч(ТипЗнчСуб.ПривестиЗначение());
				ЗначениеСубконто = АналитикиУчета[ТипЗнчСубконто];
				Проводка[ИмяСубконто][ВидСубконто] = ТипЗнчСуб.ПривестиЗначение(ЗначениеСубконто);
            КонецЕсли; 
        КонецЕсли;
	КонецЦикла;	
	
	// Количество
	Если СвСч.Количественный Тогда
		Проводка[ИмяКоличество] = СтрокаДанные.Количество*СтрокаШаблон.КоэффициентКоличество;
	КонецЕсли; 

	// Валюта, валютные суммы
	Если СвСч.Валютный Тогда
		Проводка[ИмяВалюты] = СтрокаДанные.Валюта;		
		СуммаКУстановке = СтрокаДанные["Сумма"];		
		Проводка[ИмяВалютнойСуммы] = СуммаКУстановке;
	КонецЕсли; 
	
КонецПроцедуры

Функция НовыйШаблонПроводки()
	
	ОписаниеСчет    = Новый ОписаниеТипов("ПланСчетовСсылка.бит_Бюджетирование");
	ОписаниеЧисло   = ОбщегоНазначения.ОписаниеТипаЧисло(10, 3);
	ОписаниеСтрока  = ОбщегоНазначения.ОписаниеТипаСтрока(150);
	ОписаниеСпособ  = Новый ОписаниеТипов("ПеречислениеСсылка.бит_СпособыЗаполненияСуммПроводокБюджетирования");
	
	Шаблон = Новый ТаблицаЗначений;
	Шаблон.Колонки.Добавить("СчетДТ",				 ОписаниеСчет);
	Шаблон.Колонки.Добавить("СчетКТ",				 ОписаниеСчет);
	Шаблон.Колонки.Добавить("КоэффициентСумма",		 ОписаниеЧисло);
	Шаблон.Колонки.Добавить("КоэффициентКоличество", ОписаниеЧисло);
	Шаблон.Колонки.Добавить("Содержание",			 ОписаниеСтрока);
	
	Возврат Шаблон;

КонецФункции
 
#КонецОбласти
